output/posts/emacs_headline_auto_indent/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs让标题自动提前 | My Nikola Site</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/emacs_headline_auto_indent/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nikola Tesla">
<link rel="prev" href="../elf/" title="elf" type="text/html">
<link rel="next" href="../hello-vue/" title="Vue 跑起来HelloWorld" type="text/html">
<meta property="og:site_name" content="My Nikola Site">
<meta property="og:title" content="Emacs让标题自动提前">
<meta property="og:url" content="https://example.com/posts/emacs_headline_auto_indent/">
<meta property="og:description" content="我使用的是 org mode + eval 。




总有个比较烦的事情。比如


Input * First Node to input a outline
Escape to normal noe
Use o to start a new line, emacs will auto indent in this new line
Input * Second Node to input a ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-03-19T13:31:39+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">My Nikola Site</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Emacs让标题自动提前</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../../authors/nikola-tesla/">Nikola Tesla</a>
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-03-19T13:31:39+08:00" itemprop="datePublished" title="2018-03-19 13:31">2018-03-19 13:31</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
我使用的是 <code>org mode + eval</code> 。
</p>


<p>
总有个比较烦的事情。比如
</p>
<ol class="org-ol">
<li>Input * First Node to input a outline</li>
<li>Escape to normal noe</li>
<li>Use o to start a new line, emacs will auto indent in this new line</li>
<li>Input * Second Node to input a new outline</li>
</ol>
<p>
这个时候我想要的效果是我再加一个空格的时候，*好应该可以自动跑到行首，因为90%的情况都是想新起一样的
</p>

<p>
好的，以此为目的，我们来修改我们的emacs吧
</p>

<div id="outline-container-org4a19daa" class="outline-2">
<h2 id="org4a19daa">思路</h2>
<div class="outline-text-2" id="text-org4a19daa">
<p>
我们可以按照这个步骤实现我们的需求
</p>
<ul class="org-ul">
<li>给org-mode增加hook（为了简单起见，不理evil）。每次buffer改变的时候，判断是否需要处理</li>
<li>如果需要处理，删除行首到本行第一个不为的字符</li>
</ul>
</div>
</div>

<div id="outline-container-orge6ad8df" class="outline-2">
<h2 id="orge6ad8df">实现</h2>
<div class="outline-text-2" id="text-orge6ad8df">
<p>
我们安装前面的思路来实现这个功能
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">th_headline-auto-indent</span><span class="p">(</span><span class="nf">start</span> <span class="nv">end</span> <span class="nv">len</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="k">and </span><span class="p">(</span><span class="nf">eq</span> <span class="nv">len</span> <span class="mi">0</span><span class="p">)</span>
       <span class="p">(</span><span class="nf">th_should-handle-headline</span><span class="p">))</span>
      <span class="p">(</span><span class="nf">save-excursion</span> <span class="p">(</span><span class="nf">th_del-space-to-asterisk</span><span class="p">))</span>
    <span class="p">(</span><span class="nf">message</span> <span class="s">"not headline"</span><span class="p">)))</span>

<span class="p">(</span><span class="nf">defun</span> <span class="nv">th_should-handle-headline</span><span class="p">()</span>
  <span class="s">"是否应该处理headline的缩进, 当*(一个多多个)不在行首的时候，应该处理."</span>
  <span class="p">(</span><span class="nf">and</span>
   <span class="p">(</span><span class="nf">eq</span> <span class="p">(</span><span class="nf">char-syntax</span> <span class="p">(</span><span class="nf">preceding-char</span><span class="p">))</span> <span class="nv">?</span><span class="err">\</span> <span class="p">)</span>
   <span class="p">(</span><span class="nf">looking-back</span> <span class="s">"^\\s +\\*\\s "</span> <span class="nv">nil</span><span class="p">)))</span>

<span class="p">(</span><span class="nf">defun</span> <span class="nv">th_del-space-to-asterisk</span><span class="p">()</span>
  <span class="s">"从行首开始，删除至第一个不为空格的元素."</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">left</span> <span class="p">(</span><span class="nf">progn</span>
		<span class="p">(</span><span class="nf">beginning-of-line</span><span class="p">)</span>
		<span class="p">(</span><span class="nf">point</span><span class="p">)))</span>
	<span class="p">(</span><span class="nf">right</span> <span class="p">(</span><span class="nf">progn</span>
		 <span class="p">(</span><span class="nf">beginning-of-line</span><span class="p">)</span>
		 <span class="p">(</span><span class="nf">skip-syntax-forward</span> <span class="s">" "</span><span class="p">)</span>
		 <span class="p">(</span><span class="nf">point</span><span class="p">))))</span>
    <span class="p">(</span><span class="nf">delete-region</span> <span class="nv">left</span> <span class="nv">right</span><span class="p">)))</span>

<span class="p">(</span><span class="nf">defun</span> <span class="nv">th_add-headline-auto-indent-hook</span><span class="p">()</span>
    <span class="p">(</span><span class="nf">add-hook</span> <span class="ss">'after-change-functions</span> <span class="ss">'th_headline-auto-indent</span> <span class="nv">t</span> <span class="nv">t</span><span class="p">))</span>

    <span class="p">(</span><span class="nf">add-hook</span> <span class="ss">'org-mode-hook</span> <span class="ss">'th_add-headline-auto-indent-hook</span> <span class="nv">t</span><span class="p">)</span>
</pre></div>

<ul class="org-ul">
<li>
<code>save-excursion</code> 让鼠标复原</li>
<li>
<code>char-syntax</code> 将一个char的syntax code返回，返回值是一个char。而?\ 为空格char。elisp中char为一个整数值。</li>
</ul>
<p>
?\ 为空格的char。类似的还有?a为a的char。
</p>
<ul class="org-ul">
<li>
<code>skip-syntax-forward</code> 按照给出的syntax class(此处为空白)往前进。跳过所有空白（空格，换行符等）</li>
<li>
<code>add-hook</code> 第4个参数为true的话，为往参数1本地hook（如果没有就创建）中添加hook</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../elf/" rel="prev" title="elf">Previous post</a>
            </li>
            <li class="next">
                <a href="../hello-vue/" rel="next" title="Vue 跑起来HelloWorld">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:n.tesla@example.com">Nikola Tesla</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
